URLShortener/app/models/shortened_url.rb

  def self.random_code
    code = SecureRandom.urlsafe_base64
    if !self.exists?(:short_url => code)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "9rFrmfQTzcLtYQvLrgejwg"], ["LIMIT", 1]]

  def self.create_shortened_url(user, long_url)
    ShortenedUrl.create!(:long_url => long_url, :short_url => ShortenedUrl.random_code, :user_id => user.id)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "http://www.google.com"], ["short_url", "9rFrmfQTzcLtYQvLrgejwg"], ["user_id", 1], ["created_at", "2019-03-27 23:49:34.957088"], ["updated_at", "2019-03-27 23:49:34.957088"]]