URLShortener/app/models/visit.rb

INSERT INTO "visits" ("short_url_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["short_url_id", 1], ["user_id", 1], ["created_at", "2019-03-27 23:46:54.505083"], ["updated_at", "2019-03-27 23:46:54.505083"]]
---
    def self.record_visit!(user, shortened_url)
      Visit.create!(:user_id => user.id, :short_url_id => shortened_url.id)